# скользящее среднее закреплено
rolling_mean_days = 7

# для читаемых данных ввода и данных на графиках
dict_en_ru = {
    "date" : "Дата",
    "city" : "Город",
    "avg_temp" : "Температура",
    "total_precip" : "Количество осадков",
    "avg_wind" : "Ветер",
    "is_rainy" : "Признак дождя",
    "comfort_index": "Индекс комфорта (чем выше — тем комфортнее)" 
    }

# для читаемых данных ввода и данных на графиках
dict_en_ru_city = {
    "Moscow" : "Москва",
    "Bangkok": "Бангкок",
    "Berlin": "Берлин",
    "Dubai": "Дубай",
    "Cairo": "Каир",
    "Kathmandu": "Катманду",
    "Cape Town": "Кейптаун",
    "London" : "Лондон",
    "Los Angeles": "Лос-Анджелес",
    "Madrid": "Мадрид",
    "Montevideo": "Монтевидео",
    "New York" : "Нью-Йорк",
    "Paris" : "Париж",
    "Beijing": "Пекин",
    "Rio de Janeiro": "Рио-де-Жанейро",
    "Tokyo" : "Токио",
    "Toronto": "Торонто",
    "Seoul": "Сеул",
    "Sydney": "Сидней",
    "Singapore": "Сингапур",
    "Istanbul": "Стамбул",    
    "Rome": "Рим",       
    }

# для читаемых данных на графиках
dict_ru_ru = {
    "Москва" : "Москвы",
    "Токио" : "Токио",
    "Нью-Йорк" : "Нью-Йорка",
    "Лондон" : "Лондона",
    "Париж" : "Парижа",
    "Пекин": "Пекина",
    "Берлин": "Берлина",
    "Стамбул": "Стамбула",
    "Мадрид": "Мадрида",
    "Рим": "Рима",
    "Каир": "Каира",
    "Дубай": "Дубая",
    "Сидней": "Сиднея",
    "Лос-Анджелес": "Лос-Анджелеса",
    "Сингапур": "Сингапура",
    "Сеул": "Сеула",
    "Бангкок": "Бангкока",
    "Рио-де-Жанейро": "Рио-де-Жанейро",
    "Кейптаун": "Кейптауна",
    "Торонто": "Торонто",
    "Катманду": "Катманду",
    "Монтевидео": "Монтевидео"
    }