# скользящее среднее закреплено
rolling_mean_days = 7

# для читаемых данных ввода и данных на графиках
dict_en_ru = {
    "date" : "Дата",
    "city" : "Город",
    "avg_temp" : "Температура",
    "total_precip" : "Количество осадков",
    "avg_wind" : "Ветер",
    "is_rainy" : "Признак дождя"
    }

# для читаемых данных ввода и данных на графиках
dict_en_ru_city = {
    "Moscow" : "Москва",
    "Tokyo" : "Токио",
    "New York" : "Нью-Йорк",
    "London" : "Лондон"
    }

# для читаемых данных на графиках
dict_ru_ru = {
    "Москва" : "Москвы",
    "Токио" : "Токио",
    "Нью-Йорк" : "Нью-Йорка",
    "Лондон" : "Лондона"
    }